# Rebar Curves Data Get Added Bar Geometry Method

Source: https://www.revitapidocs.com/2026/c9c202d7-a7b6-32f7-440e-db2377853754.htm

---

| Rebar Curves Data Get Added Bar Geometry Method |
| --- |

Gets the added curves that will represent the bar at index barIndex.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<Curve> GetAddedBarGeometry(
	int barIndex
)
```

```
Public Function GetAddedBarGeometry (
	barIndex As Integer
) As IList(Of Curve)
```

```
public:
IList<Curve^>^ GetAddedBarGeometry(
	int barIndex
)
```

```
member GetAddedBarGeometry :
        barIndex : int -> IList<Curve>
```

#### Parameters

barIndex Int32
:   The index of the bar. Should be a number between 0 and GetNumberOfBarGeometry() \- 1\.

#### Return Value

IList Curve
Returns the curves that will represent the bar at index barIndex. The terminations' plane normals will be applied on these curves. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | barIndex is not in the range \[ 0, GetNumberOfBarGeometry()\-1 ]. |

See Also

#### Reference

RebarCurvesData Class Autodesk.Revit.DB.Structure Namespace